# Dm Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Dm Property
SymbolTypeId Class See Also
---
Symbol dm, indicating unit Decimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Dm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Dm As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Dm {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace